content/c/3rd-libs/libev-manual.org
# -*- coding:utf-8-*-
#+TITLE: libev manual
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

本文是 [[http://pod.tst.eu/http://cvs.schmorp.de/libev/ev.pod][原手册]] 的简单翻译。

* 示例
  参见 [[https://github.com/phenix3443/test/blob/master/c/libev/tutor.c][tutor.c]]

* 关于 LIBEV
  Libev 是一个事件循环：注册某些感兴趣的事件（例如文件描述符可读或发生超时），它将管理这些事件源并为程序提供事件。

  要做到这一点，它必须通过执行事件循环处理程序，这或多或少控制您的进程（或线程），然后通过回调机制传递事件。

  通过注册所谓的事件观察者（event watcher）来注册某些感兴趣的事件（event），这些事件观察者是使用事件的详细信息初始化的相对较小的 C 结构，然后通过启动观察者将其交给 libev。

* 特征
  Libev 支持：
  + ev_io：用于文件描述符事件，支持：
    + select，poll
    + Linux 特有的 aio 和 epoll 接口
    + BSD 特有的 kqueue
    + Solaris 特有事件端口机制
  + ev_stat：Linux inotify 接口，
  + Linux eventfd/signalfd （用于更快和更清晰的线程间唤醒（ev_async）/信号处理（ev_signal））
  + ev_timer：相对定时器
  + ev_periodic：具有定制重新调度的绝对定时器，
  + ev_signal：同步信号，
  + ev_child：进程状态改变事件
  + ev_idle，ev_embed，ev_prepare 和 ev_check：和事件观察器处理事件循环机制本身。
  + ev_stat：文件观察者
  + ev_fork：fork 事件的有限支持。

* 约定
  Libev 非常易于配置。在本手册中，将描述默认（和最常见）配置，它支持多个事件循环。有关各种配置选项的更多信息，请参阅本手册中的 EMBED 部分。如果配置 libev 不支持多个事件循环，则所有带有名称为 loop 的初始参数的函数（loop 类型为 =struct ev_loop *= ）将不具有此参数。

* 时间表示
  Libev 将时间表示为单个浮点数，表示自 epoch 以来的秒数（小数）（实际上在 1970 年初的某个事件，细节很复杂，不要问）。这种类型称为 ev_tstamp，这也是应该使用的。它通常是 C 中的 double 类型的别名。当需要对其进行任何计算时，应将其视为某个浮点值。

  与名称 stamp 所示不同，libev 它还用于时间间隔（例如延迟）。

* 错误处理
  Libev 知道三类错误：操作系统错误，使用错误和内部错误。

  当 libev 捕获到无法处理的操作系统错误时（例如 libev 无法修复的系统调用），它会通过 ev_set_syserr_cb 调用回调函数，这应该可以解决问题或中止。默认设置是打印诊断消息并调用 abort()。

  当 libev 检测到使用错误（例如负计时器间隔）时，它将打印诊断消息并中止（通过断言机制，因此 NDEBUG 将禁用此检查）：这些是 libev 调用者的编程错误，需要在那里修复。

  通过 EV_FREQUENT 宏，您可以编译和/或在 libev 中启用广泛的一致性检查代码，该代码可用于检查内部不一致，这通常是由应用程序错误引起的。

  Libev 还有一些内部错误检查断言。这些在正常情况下不会触发，因为它们表示 libev 的 bug 或更糟的错误。

