c/3rd-libs/libev-manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-06 五 17:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>libev manual</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">libev manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2bbc92d">1. 示例</a></li>
<li><a href="#org92a6492">2. 关于 LIBEV</a></li>
<li><a href="#org69042eb">3. 特征</a></li>
<li><a href="#org7e861e4">4. 约定</a></li>
<li><a href="#orgc71b6d0">5. 时间表示</a></li>
<li><a href="#org55aef40">6. 错误处理</a></li>
<li><a href="#org6f0be3e">7. 全局函数</a></li>
<li><a href="#orga978447">8. 控制 event 循环的函数</a></li>
<li><a href="#org30f0e2b">9. 解剖观察者</a></li>
<li><a href="#orgac5e0da">10. 通用观察者函数</a></li>
<li><a href="#org39400ba">11. 观察者状态</a></li>
<li><a href="#org869b188">12. 观察者优先模型</a></li>
<li><a href="#orgeae7381">13. 观察者类型</a>
<ul>
<li><a href="#org772e11d">13.1. ev_io - is this file descriptor readable or writable?</a>
<ul>
<li><a href="#orgc620c60">13.1.1. The special problem of disappearing file descriptors</a></li>
<li><a href="#org1d5d060">13.1.2. The special problem of dup'ed file descriptors</a></li>
<li><a href="#org6bae8a7">13.1.3. The special problem of files</a></li>
<li><a href="#orge0bf48d">13.1.4. The special problem of fork</a></li>
<li><a href="#orga2f677a">13.1.5. The special problem of SIGPIPE</a></li>
<li><a href="#org981ad8b">13.1.6. The special problem of accept()ing when you can't</a></li>
<li><a href="#orgea4dfd4">13.1.7. Watcher-Specific Functions</a></li>
<li><a href="#org15223c8">13.1.8. 示例</a></li>
</ul>
</li>
<li><a href="#org2c6c73f">13.2. ev_timer - relative and optionally repeating timeouts</a></li>
<li><a href="#org9917a5a">13.3. ev_periodic - to cron or not to cron?</a></li>
<li><a href="#org3eec9ea">13.4. ev_signal - signal me when a signal gets signalled!</a></li>
<li><a href="#orgc46608f">13.5. ev_stat - did the file attributes just change?</a></li>
<li><a href="#orge4ab9fa">13.6. ev_idle - when you've got nothing better to do&#x2026;</a></li>
<li><a href="#orgbe8386e">13.7. ev_prepare and ev_check - customise your event loop!</a></li>
<li><a href="#org0a15941">13.8. ev_embed - when one backend isn't enough&#x2026;</a></li>
<li><a href="#org6ec0565">13.9. ev_fork - the audacity to resume the event loop after a fork</a></li>
<li><a href="#orgb3add93">13.10. ev_cleanup - even the best things end</a></li>
<li><a href="#org1b01117">13.11. ev_async - how to wake up an event loop</a>
<ul>
<li><a href="#org3f3dea8">13.11.1. Queueing</a>
<ul>
<li><a href="#org37c1b9e">13.11.1.1. queueing from a signal handler context</a></li>
<li><a href="#org341bdb4">13.11.1.2. queueing from a thread context</a></li>
</ul>
</li>
<li><a href="#org7e28929">13.11.2. Watcher-Specific Functions and Data Members</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5fd911c">14. 通用或有用的模型</a></li>
<li><a href="#org147b8e3">15. 模拟 libevent</a></li>
<li><a href="#orga0e392e">16. C++ 支持</a></li>
<li><a href="#orgd7b8c3f">17. 其他语言绑定</a></li>
<li><a href="#orga65ec71">18. 宏魔法</a></li>
<li><a href="#org11f67d2">19. 嵌套</a></li>
<li><a href="#org89ec2ec">20. 与其他程序、库或者环境交互</a></li>
<li><a href="#org09a9d7b">21. 可移植性注意事项</a></li>
<li><a href="#org714b3c0">22. 算法复杂度</a></li>
<li><a href="#orgd728d53">23. 从 LIBEV 3.X 到 4.X 的移植</a></li>
<li><a href="#orgc7dc7b1">24. 词汇表</a></li>
<li><a href="#org97ba8c9">25. 作者</a></li>
</ul>
</div>
</div>
<p>
本文是 <a href="http://pod.tst.eu/http://cvs.schmorp.de/libev/ev.pod">原手册</a> 的简单翻译。
</p>

<div id="outline-container-org2bbc92d" class="outline-2">
<h2 id="org2bbc92d"><span class="section-number-2">1</span> 示例</h2>
<div class="outline-text-2" id="text-1">
<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/libev/tutor.c">tutor.c</a>
</p>
</div>
</div>

<div id="outline-container-org92a6492" class="outline-2">
<h2 id="org92a6492"><span class="section-number-2">2</span> 关于 LIBEV</h2>
<div class="outline-text-2" id="text-2">
<p>
Libev 是一个事件循环：注册某些感兴趣的事件（例如文件描述符可读或发生超时），它将管理这些事件源并为程序提供事件。
</p>

<p>
要做到这一点，它必须通过执行事件循环处理程序，这或多或少控制您的进程（或线程），然后通过回调机制传递事件。
</p>

<p>
通过注册所谓的事件观察者（event watcher）来注册某些感兴趣的事件（event），这些事件观察者是使用事件的详细信息初始化的相对较小的 C 结构，然后通过启动观察者将其交给 libev。
</p>
</div>
</div>

<div id="outline-container-org69042eb" class="outline-2">
<h2 id="org69042eb"><span class="section-number-2">3</span> 特征</h2>
<div class="outline-text-2" id="text-3">
<p>
Libev 支持：
</p>
<ul class="org-ul">
<li>ev_io：用于文件描述符事件，支持：
<ul class="org-ul">
<li>select，poll</li>
<li>Linux 特有的 aio 和 epoll 接口</li>
<li>BSD 特有的 kqueue</li>
<li>Solaris 特有事件端口机制</li>
</ul></li>
<li>ev_stat：Linux inotify 接口，</li>
<li>Linux eventfd/signalfd （用于更快和更清晰的线程间唤醒（ev_async）/信号处理（ev_signal））</li>
<li>ev_timer：相对定时器</li>
<li>ev_periodic：具有定制重新调度的绝对定时器，</li>
<li>ev_signal：同步信号，</li>
<li>ev_child：进程状态改变事件</li>
<li>ev_idle，ev_embed，ev_prepare 和 ev_check：和事件观察器处理事件循环机制本身。</li>
<li>ev_stat：文件观察者</li>
<li>ev_fork：fork 事件的有限支持。</li>
</ul>
</div>
</div>

<div id="outline-container-org7e861e4" class="outline-2">
<h2 id="org7e861e4"><span class="section-number-2">4</span> 约定</h2>
<div class="outline-text-2" id="text-4">
<p>
Libev 非常易于配置。在本手册中，将描述默认（和最常见）配置，它支持多个事件循环。有关各种配置选项的更多信息，请参阅本手册中的 EMBED 部分。如果配置 libev 不支持多个事件循环，则所有带有名称为 loop 的初始参数的函数（loop 类型为 <code>struct ev_loop *</code> ）将不具有此参数。
</p>
</div>
</div>

<div id="outline-container-orgc71b6d0" class="outline-2">
<h2 id="orgc71b6d0"><span class="section-number-2">5</span> 时间表示</h2>
<div class="outline-text-2" id="text-5">
<p>
Libev 将时间表示为单个浮点数，表示自 epoch 以来的秒数（小数）（实际上在 1970 年初的某个事件，细节很复杂，不要问）。这种类型称为 ev_tstamp，这也是应该使用的。它通常是 C 中的 double 类型的别名。当需要对其进行任何计算时，应将其视为某个浮点值。
</p>

<p>
与名称 stamp 所示不同，libev 它还用于时间间隔（例如延迟）。
</p>
</div>
</div>

<div id="outline-container-org55aef40" class="outline-2">
<h2 id="org55aef40"><span class="section-number-2">6</span> 错误处理</h2>
<div class="outline-text-2" id="text-6">
<p>
Libev 知道三类错误：操作系统错误，使用错误和内部错误。
</p>

<p>
当 libev 捕获到无法处理的操作系统错误时（例如 libev 无法修复的系统调用），它会通过 ev_set_syserr_cb 调用回调函数，这应该可以解决问题或中止。默认设置是打印诊断消息并调用 abort()。
</p>

<p>
当 libev 检测到使用错误（例如负计时器间隔）时，它将打印诊断消息并中止（通过断言机制，因此 NDEBUG 将禁用此检查）：这些是 libev 调用者的编程错误，需要在那里修复。
</p>

<p>
通过 EV_FREQUENT 宏，您可以编译和/或在 libev 中启用广泛的一致性检查代码，该代码可用于检查内部不一致，这通常是由应用程序错误引起的。
</p>

<p>
Libev 还有一些内部错误检查断言。这些在正常情况下不会触发，因为它们表示 libev 的 bug 或更糟的错误。
</p>
</div>
</div>
