content/c/3rd-libs/libev-manual.org
* 全局函数
  即使在以任何方式初始化库之前，也可以随时调用这些函数。
  + ev_tstamp ev_time ()

    返回 libev 使用它的当前时间。请注意，ev_now 函数通常更快，并且通常还会返回您实际想知道的时间戳。同样有趣的是 ev_now_update 和 ev_now 的组合。

  + ev_sleep (ev_tstamp interval)

    休眠在给定的时间间隔：当前线程将被阻塞，直到它被中断或者给定的时间间隔已经过去（大约 - 即使没有中断，它也可能提前返回）。如果 interval <= 0，则立即返回。

    基本上这是一个亚秒级分辨率的 =sleep()= 。

    interval 的范围是有限的 - libev 仅保证最多一天的睡眠时间（interval<= 86400）。

  + int ev_version_major ()
  + int ev_version_minor ()

    可以通过调用函数 ev_version_major 和 ev_version_minor 找到您链接的库的主要和次要 ABI 版本号。如果需要，可以与全局符号 EV_VERSION_MAJOR 和 EV_VERSION_MINOR 进行比较，后者指定编译程序库的版本。

    这些版本号是指库的 ABI 版本，而不是发行版本。

    通常，如果主要版本不匹配，最好终止，因为这表明不兼容的更改。次要版本通常与旧版本兼容，因此单独使用较大的次要版本通常不是问题。

    示例：确保我们没有意外地链接到错误的版本（但请注意，这不会检测到其他 ABI 不匹配，例如 LFS 或重入）。

    #+BEGIN_SRC c
assert(("libev version mismatch", ev_version_major() == EV_VERSION_MAJOR &&
                                      ev_version_minor() >= EV_VERSION_MINOR));
    #+END_SRC

  + unsigned int ev_supported_backends ()

    返回编译到 libev 二进制文件中的所有后端集（即它们对应的 EV_BACKEND_* 值）（与它们在您运行的系统上的可用性无关）。有关设置值的说明，请参阅 ev_default_loop。

    例如：确保我们有 epoll 方法:

    #+BEGIN_SRC c
assert(("sorry, no epoll, no sex", ev_supported_backends() & EVBACKEND_EPOLL));
    #+END_SRC

  + unsigned int ev_recommended_backends ()

    返回编译到 libev 二进制文件中的所有后端的集合，以及推荐用于此平台的后端，这意味着它适用于大多数文件描述符类型。这个集合通常小于 ev_supported_backends 返回的集合，例如 kqueue 在大多数 BSD 上被破坏，除非你明确请求它（假设你知道你在做什么），否则不会被自动检测到。如果您没有明确指定后端，那么 libev 将探测的后端集合。

  + unsigned int ev_embeddable_backends ()

    返回可嵌入其他事件循环的后端集。此值是平台相关的，但可以包括当前系统上不可用的后端。要查找当前系统可能支持哪些可嵌入的后端，您需要查看 ev_embeddable_backends（）和 ev_supported_backends（），同样适用于推荐的后端。

    有关详细信息，请参阅 ev_embed 观察者的说明。

  + ev_set_allocator (void *(*cb)(void *ptr, long size) throw ())

    设置要使用的分配函数（函数原型类似 - 语义与 realloc C89 / SuS / POSIX 函数相同）。它用于分配和释放内存。如果在需要分配内存（size！= 0）时它返回零，则库可能会中止或采取一些潜在的破坏性操作。

    由于某些系统（至少 OpenBSD 和 Darwin）无法实现正确的 realloc 语义，因此 libev 将默认使用系统 realloc 和 free 函数的包装器。

    您可以在高可用性程序中覆盖此功能，例如，如果无法分配内存，使用特殊分配器，甚至暂停一段时间并重试直到某些内存可用，则释放一些内存。

    示例：以下是 libev 本身使用的 realloc 函数，它应该与各种 realloc 和 free 函数一起使用，并且可能是您自己的实现的良好基础：

    #+BEGIN_SRC c
static void *ev_realloc_emul(void *ptr, long size) EV_NOEXCEPT {
  if (size) return realloc(ptr, size);

  free(ptr);
  return 0;
}
    #+END_SRC

    示例：将 libev 分配器替换为等待一个然后重试的分配器。

    #+BEGIN_SRC c
static void *persistent_realloc(void *ptr, size_t size) {
  if (!size) {
    free(ptr);
    return 0;
  }

  for (;;) {
    void *newptr = realloc(ptr, size);

    if (newptr) return newptr;

    sleep(60);
  }
}

... ev_set_allocator(persistent_realloc);
    #+END_SRC

  + ev_set_syserr_cb (void (*cb)(const char *msg) throw ())

    设置发生可重试的系统调用错误（例如，选择，轮询，epoll_wait 失败）时候的回调函数。该消息是可打印的字符串，指示导致问题的系统调用或子系统。如果设置了这个回调，那么 libev 将期望它能够在不知何时返回时解决这个问题。也就是说，libev 通常会重试所请求的操作，或者，如果条件没有消失，则执行不好的操作（例如中止）。

    示例：这与 libev 内部执行的操作基本相同。

    #+BEGIN_SRC c
static void fatal_error(const char *msg) {
  perror(msg);
  abort();
}

... ev_set_syserr_cb(fatal_error);
    #+END_SRC

  + ev_feed_signal (int signum)

    此功能可用于“模拟”信号接收。从任何环境（包括信号处理程序或随机线程）随时调用此函数是完全安全的。

    它的主要用途是在您的过程中自定义信号处理，尤其是在线程存在的情况下。例如，您可以在所有线程中默认阻止信号（并在创建任何循环时指定 EVFLAG_NOSIGMASK），并在一个线程中使用 sigwait 或任何其他机制等待信号，然后通过调用 ev_feed_signal 将它们“传递”到 libev。

