content/c/3rd-libs/libev-manual.org
* 解剖观察者
  在下面的描述中，名称中的大写 TYPE 代表观察者类型，例如，ev_TYPE_start 可以表示定时器观察器的 ev_timer_start 和 I/O 观察器的 ev_io_start。

  观察者是一种不透明的结构，您可以分配并注册以记录某些感兴趣的事件。举一个具体的例子，假设您想等待 STDIN 变得可读，您将为此创建一个 ev_io 观察器：

  #+BEGIN_SRC c
static void my_cb(struct ev_loop *loop, ev_io *w, int revents) {
  ev_io_stop(w);
  ev_break(loop, EVBREAK_ALL);
}

struct ev_loop *loop = ev_default_loop(0);

ev_io stdin_watcher;

ev_init(&stdin_watcher, my_cb);
ev_io_set(&stdin_watcher, STDIN_FILENO, EV_READ);
ev_io_start(loop, &stdin_watcher);

ev_run(loop, 0);
  #+END_SRC

  如您所见，您负责为您的观察器结构分配内存（在堆栈上执行此操作通常是个坏主意）。

  每个观察者都有一个相关的观察者结构（称为 struct ev_TYPE 或简称为 ev_TYPE，因为所有观察者结构使用 typedef）。

  必须通过调用 =ev_init（watcher *，callback）= 来初始化每个观察者结构，以及提供回调。 每次事件发生时都会调用此回调（或者，在 I / O 观察器的情况下，每次事件循环检测到给定的文件描述符是可读和/或可写的）。

  每个观察者类型还具有自己的 =ev_TYPE_set（watcher *，...）= 宏来配置它，有特定于观察者类型的参数。在一个调用中还有一个用于组合初始化和设置的宏： =ev_TYPE_init(watcher *，callback，...)= 。

  为了让观察者真正监测事件，必须使用观察者特定的启动函数（ =ev_TYPE_start（loop，watcher *）= ）启动它，你可以通过调用相应的停止功能随时停止观察事件（ =ev_TYPE_stop(loop，watcher*)= )。

  只要您的观察者处于活动状态（已启动但未停止），您就不能访问存储在其中的值。最重要的是，您必须永远不要重新初始化它或调用它的 ev_TYPE_set 宏。

  每个回调接收事件循环指针作为第一个，注册的观察者结构作为第二个，并且接收的事件的比特集作为第三个参数。收到的事件通常包括每个事件类型接收一个位（您可以同时接收多个事件）。可能的位掩码是：

  + EV_READ
  + EV_WRITE

    ev_io 观察器中的文件描述符已变得可读和/或可写。

  + EV_TIMER

    ev_timer 观察者已经超时了。

  + EV_PERIODIC

    ev_periodic 观察者已超时。

  + EV_SIGNAL

    ev_signal 观察器中指定的信号已被线程接收。

  + EV_CHILD

    ev_child 观察程序中指定的 pid 已收到状态更改。

  + EV_STAT

    ev_stat 观察器中指定的路径以某种方式更改了其属性。

  + EV_IDLE

    ev_idle 观察者已经确定你没有更好的事情要做。

  + EV_PREPARE
  + EV_CHECK

    所有 ev_prepare 观察者都在 ev_run 开始收集新事件之前调用，并且所有 ev_check 观察者在 ev_run 收集它们之后排队（未调用），但在它排队任何接收到的事件的回调之前。这意味着 ev_prepare 观察者是在事件循环休眠或轮询新事件之前调用的最后一个观察者，并且 ev_check 观察者将在事件循环迭代中的任何其他具有相同或较低优先级的观察者之前被调用。

    两种观察者类型的回调可以像他们想要的那样开始和停止所有观察者，并且所有观察者都将被考虑在内（例如，ev_prepare 观察者可能启动空闲观察者以防止 ev_run 阻止）。

  + EV_EMBED

    ev_embed 观察者中指定的嵌入式事件循环需要引起注意。

  + EV_FORK

    在 fork 之后，子进程中的事件循环已恢复（请参阅 ev_fork）。

  + EV_CLEANUP

    事件循环即将被销毁（参见 ev_cleanup）。

  + EV_ASYNC

    已异步通知给定的异步观察器（请参阅 ev_async）。

  + EV_CUSTOM

    libev 本身并未发送（或以其他方式使用），但 libev 用户可以自由地使用它来发信号通知观察者（例如通过 ev_feed_event）。

  + EV_ERROR

    发生了未指定的错误，观察者已停止。这可能是因为观察者无法正常启动，因为 libev 内存不足，发现文件描述符已关闭或任何其他问题。 Libev 考虑了这些应用程序错误。

    你最好通过报告问题并以某种方式应对被拦截的观察者来采取行动。请注意，编写良好的程序不应该收到任何错误，所以当您的观察者收到它时，这通常表示您的程序中存在错误。

    Libev 通常会发出一些“虚假”事件和一个错误信号，例如它可能表明 fd 是可读写的，如果你的回调写得很好，它只能尝试操作并处理 read() 或者 write()。但是，这在多线程程序中不起作用，因为 fd 已经可以关闭并重新用于其他事情，所以要小心。

* 通用观察者函数
  + ev_init (ev_TYPE *watcher, callback)

    该宏初始化观察者的通用部分。观察者对象的内容可以是任意的（因此 malloc 会这样做）。只初始化了观察程序的通用部分，之后需要调用特定于类型的 ev_TYPE_set 宏来初始化特定于类型的部分。对于每种类型，还有一个 ev_TYPE_init 宏，它将两个调用都包装成一个。

    可以随时重新初始化观察者，只要它已被停止（或从未开始）并且没有待处理的待处理事件。

    回调总是类型为 =void (*)(struct ev_loop *loop, ev_TYPE *watcher, int revents)= 。

    示例：分两步初始化 ev_io 观察程序。
    #+BEGIN_SRC c
ev_io w;
ev_init(&w, my_cb);
ev_io_set(&w, STDIN_FILENO, EV_READ);
    #+END_SRC

  + ev_TYPE_set (ev_TYPE *watcher, [args])

    此宏初始化观察者的类型特定部分。在调用此宏之前，您需要至少调用一次 ev_init，但您可以多次调用 ev_TYPE_set。但是，您不能在处于活动状态的观察器上调用此宏（但它可以处于挂起状态，这与 ev_init 宏不同）。

    虽然某些观察者类型没有特定于类型的参数（例如 ev_prepare），但您仍需要调用其 set 宏。

    请参阅上面的 ev_init，以获取前者

  + ev_TYPE_init (ev_TYPE *watcher, callback, [args])

    此宏将 ev_init 和 ev_TYPE_set 宏调用都转换为单个调用。这是初始化观察者最方便的方法。当然，同样的限制也适用。

    示例：初始化并设置 ev_io

    #+BEGIN_SRC c
ev_io_init (&w, my_cb, STDIN_FILENO, EV_READ);
    #+END_SRC

  + ev_TYPE_start (loop, ev_TYPE *watcher)

    启动（激活）给定的观察者。只有活跃的观察者才会收到活动。如果观察者已经活跃，则不会发生任何事情。

    示例：在整个部分中启动正在滥用的 ev_io 观察程序作为示例。
    #+BEGIN_SRC c
ev_io_start (EV_DEFAULT_UC, &w);
    #+END_SRC

  + ev_TYPE_stop (loop, ev_TYPE *watcher)

    如果处于活动状态，则停止指定的观察者，并清除挂起状态（不管观察者是否处于活动状态）。

    停止的观察者可能正在等待 - 例如，非重复计时器在它们变为待定时停止 - 但调用 ev_TYPE_stop 可确保观察者既不活动也不挂起。如果你想释放或重用观察者使用的内存，那么总是调用它的 ev_TYPE_stop 函数是个好主意。

  + bool ev_is_active（ev_TYPE * watcher）

    如果观察者处于活动状态（即它已经启动但尚未停止），则返回一个真值。如

  + bool ev_is_pending (ev_TYPE *watcher)

    如果观察者处于挂起状态，则返回真值（即，它具有未完成的事件，但尚未调用其回调）。只要观察者处于待处理状态（但不是活动状态），就不能在其上调用 init 函数（但是 ev_TYPE_set 是安全的），你不能改变它的优先级，你必须确保观察者可以使用 libev（例如你不能释放它）。

  + callback ev_cb (ev_TYPE *watcher)

    返回当前在观察者上设置的回调。

  + ev_set_cb (ev_TYPE *watcher, callback)

    更改回调。您几乎可以随时更改回调（modulo thread）。

  + ev_set_priority (ev_TYPE *watcher, int priority)
  + int ev_priority (ev_TYPE *watcher)

    设置并查询观察者的优先级。优先级是 EV_MAXPRI（默认值：2）和 EV_MINPRI（默认值：-2）之间的一个小整数。高优先级的挂起观察者将先被调用，但优先级将不会使观察者不被执行（除了 ev_idle 观察者）。

    如果需要在更高优先级事件挂起时禁止调用，则需要查看提供此功能的 ev_idle 观察器。

  + ev_invoke (loop, ev_TYPE *watcher, int revents)

    使用指定的 loop 和事件（revents）调用观察者。只要观察者回调可以处理 loop 和 revents 都不需要有效，因为两者都只是传递给回调。

  + int ev_clear_pending (loop, ev_TYPE *watcher)

    如果观察者处于挂起状态，则此函数将清除其挂起状态并返回其 revents bitset（就像调用其回调一样）。如果观察者没有挂起，它什么也不做，返回 0。

    有时“轮询”观察者而不是等待调用其回调很有用，这可以通过此函数来完成。

  + ev_feed_event (loop, ev_TYPE *watcher, int revents)

    将给定事件集合提供到事件循环中，就好像指定的事件对于指定的观察者已发生（必须是指向已初始化但未必启动的事件观察者的指针）上。显然，只要它有未决事件，你就不能释放观察者。

    停止观察者，让 libev 调用它，或调用 ev_clear_pending 将清除待处理的事件，即使观察者没有首先启动。

    有关不需要观察者的相关函数，另请参阅 ev_feed_fd_event 和 ev_feed_signal_event。

* 观察者状态
  本手册中提到了各种观察者状态 - 活跃，待决等等。在本节中，将更详细地描述这些状态和它们之间转换的规则 - 虽然这些规则可能看起来很复杂，但它们通常做“正确的事情”。

  + initialised

    观察者在事件循环中注册之前，必须对其进行初始化。这可以通过调用 ev_TYPE_init 来完成，或者调用 ev_init，然后调用特定于观察者的 ev_TYPE_set 函数。

    在这种状态下，它只是一些适合在事件循环中使用的内存块。它可以随意移动，释放，重用等 - 只要你保持内存内容不变，或者再次调用 ev_TYPE_init。

  + started/running/active

    一旦观察者开始调用 ev_TYPE_start，它就成为事件循环的属性，并且正在积极地等待事件。在这种状态下它无法被访问（除了一些记录的方式），移动，释放或其他任何操作 - 唯一合法的事情是保持指向它的指针，并在其上调用可以在活跃观察者身上使用的 libev 函数，

  + pending

    如果观察者处于活动状态且 libev 确定已发生其感兴趣的事件（例如计时器到期），则它将变为待处理状态。它将保持在此挂起状态，直到它被停止或其调用即将被调用，因此它通常不会在观察者回调中挂起。

    观察者在待处理时可能处于活动状态，也可能不处于活动状态（例如，过期的非重复计时器可能处于暂挂状态但不再处于活动状态）。如果它被停止，它可以自由访问（例如通过调用 ev_TYPE_set），但它此时仍然是事件循环的属性，因此不能移动，释放或重用。如果它处于活动状态，则前一项中描述的规则仍然适用。

    还可以在未激活的观察者上提供事件（例如，通过 ev_feed_event），在这种情况下，它变为待处理状态而不是活动的。

  + stopped

    可以通过 libev 隐式地停止观察者（在这种情况下它可能仍处于未决状态），或通过调用其 ev_TYPE_stop 函数显式地停止。后者将清除观察者可能处于的任何待处理状态，无论其是否处于活动状态，因此在释放观察者之前明确停止观察者通常是一个好主意。

    停止（并且未挂起）的观察者基本上处于初始化状态，也就是说，它可以以您希望的任何方式重复使用，移动和修改（但是当您丢弃内存块时，您需要再次 ev_TYPE_init。

