c/3rd-libs/libev-manual.html

<div id="outline-container-org869b188" class="outline-2">
<h2 id="org869b188"><span class="section-number-2">12</span> 观察者优先模型</h2>
<div class="outline-text-2" id="text-12">
<p>
许多事件循环支持观察者优先级，这些优先级通常是小整数，它们以某种方式影响观察者之间事件回调调用的顺序，其他条件相同。
</p>

<p>
在 libev 中，可以使用 ev_set_priority 设置 Watcher 优先级。有关更多技术细节，请参阅其说明，例如实际优先级范围。
</p>

<p>
事件循环如何解释这些优先级有两种常见方式：
</p>

<p>
常见的锁定模型，较高优先级“锁定”较低优先级观察者的调用，这意味着只要优先级较高的观察者接收事件，就不会调用较低优先级的观察者。
</p>

<p>
不太常见的排序模型，仅使用优先级来在单个事件循环迭代中对回调调用进行排序：优先调用高优先级的观察者，但在新的轮询事件之前都会调用它们。
</p>

<p>
Libev 对其所有观察者使用第二种（仅用于排序）模型，除了空闲观察者（使用锁定模型）。
</p>

<p>
这背后的基本原理是大多数内核接口都没有很好地支持为观察者实现锁定模型，并且只要他们的回调没有被执行，大多数事件库就会一次又一次地轮询相同的事件，这在一个高优先级观察者锁定大量低优先级观察者的常见情况下效率低下。
</p>

<p>
当有两个或多个处理相同资源的观察者时，静态（排序）优先级最有用：典型的使用示例是让 ev_io 观察者接收数据，以及相关的 ev_timer 来处理超时。在加载时，程序接收数据时可能在处理其他作业，但由于通常首先调用定时器，因此将在检查数据之前执行超时处理程序。在这种情况下，由于给定时器的优先级低于 I / O 观察器，可确保即使在不利条件下（通常，但并非总是如此），I / O 也将首先处理。
</p>

<p>
由于空闲观察者使用“锁定”模型，这意味着只有当没有相同或更高优先级的观察者收到事件时才会执行空闲观察者，它们可用于在需要时实施“锁定”模型。
</p>

<p>
例如，要模拟有多少其他事件库处理优先级，您可以将 ev_idle 观察者与每个此类观察者关联，并且在正常观察者回调中，您只需启动空闲观察者。实际处理在空闲观察者回调中完成。这会导致 libev 不断地为观察者轮询和处理内核事件数据，但是当知道锁定情况很少（反过来很少见:)时，这是可行的。
</p>

<p>
然而，通常，以这种方式实施的锁定模型，将在其设计用于处理的负载类型下悲惨地执行。在这种情况下，最好在启动空闲观察器之前停止真正的观察者，因此如果实际处理将延迟相当长的时间，内核将不必处理该事件。
</p>

<p>
下面是一个 I / O 观察程序的示例，它应该以低于默认值的严格优先级运行，并且只应在没有其他事件挂起时处理数据：
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00d7af;">ev_idle</span> <span style="color: #ff8700;">idle</span>;  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">actual processing watcher</span>
<span style="color: #00d7af;">ev_io</span> <span style="color: #ff8700;">io</span>;      <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">actual event watcher</span>

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">io_cb</span>(EV_P_ <span style="color: #00d7af;">ev_io</span> *<span style="color: #ff8700;">w</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">revents</span>) {
  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">stop the I/O watcher, we received the event, but</span>
  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">are not yet ready to handle it.</span>
  ev_io_stop(<span style="color: #00d7af;">EV_A_</span> <span style="color: #ff8700;">w</span>);

  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">start the idle watcher to handle the actual event.</span>
  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">it will not be executed as long as other watchers</span>
  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">with the default priority are receiving events.</span>
  ev_idle_start(EV_A_ &amp; idle);
}

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">idle_cb</span>(EV_P_ <span style="color: #00d7af;">ev_idle</span> *<span style="color: #ff8700;">w</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">revents</span>) {
  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">actual processing</span>
  read(STDIN_FILENO, ...);

  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">have to start the I/O watcher again, as</span>
  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">we have handled the event</span>
  ev_io_start(EV_P_ &amp; io);
}

<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">initialisation</span>
ev_idle_init(&amp;idle, idle_cb);
ev_io_init(&amp;io, io_cb, STDIN_FILENO, EV_READ);
<span style="color: #ffd700;">ev_io_start</span>(EV_DEFAULT_ &amp;io);
</pre>
</div>

<p>
在“真实”的世界中，启动计时器也可能是有益的，这样在负载下永远不能锁定低优先级连接。这使程序能够在短时间高负载期间为重要连接保持较低的延迟，同时不会完全锁定不太重要的连接。
</p>
</div>
</div>
<div id="outline-container-orgeae7381" class="outline-2">
<h2 id="orgeae7381"><span class="section-number-2">13</span> 观察者类型</h2>
<div class="outline-text-2" id="text-13">
<p>
本节详细介绍了每个观察者，但不会重复上一节中给出的信息。解释了特定于观察者类型的任何初始化/设置宏，函数和成员。
</p>

<p>
成员还标有[只读]，这意味着，当观察者处于活动状态时，您可以查看该成员并期望一些合理的内容，但您不能修改它，或[读写]，这意味着你可以期待它在观察者激活时有一些合理的内容，但你也可以修改它。修改它可能不会做任何明智的事情或立即生效（或做任何事情），但 libev 不会以任何方式崩溃或故障。
</p>
</div>
<div id="outline-container-org772e11d" class="outline-3">
<h3 id="org772e11d"><span class="section-number-3">13.1</span> ev_io - is this file descriptor readable or writable?</h3>
<div class="outline-text-3" id="text-13-1">
<p>
I / O 观察者在事件循环的每次迭代中检查文件描述符是可读还是可写，或者更准确地说，何时读取不会阻塞进程并且写入至少能够写入一些数据时。此行为称为水平触发，因为只要条件仍然存在，就会继续接收事件。请记住，如果您不想对事件采取行动并且不想接收未来事件，也可以停止观察者。
</p>

<p>
通常，您可以根据需要为每个 fd 注册尽可能多的读取和/或写入事件监视器（只要您不要混淆自己）。将所有文件描述符设置为非阻塞模式通常也是一个好主意（但如果您知道自己在做什么，则不需要）。
</p>

<p>
另外需要注意的是，非常容易接收到“虚假”准备就绪通知，也就是说，可以使用 EV_READ 调用回调函数，但后续的 read（2）实际上会因为没有数据而被阻塞。即使使用相对标准的程序结构，也很容易进入这种情况。因此，最好始终使用非阻塞 I / O：返回 EAGAIN 的 read 远比在某些数据到达之前挂起的程序更可取。
</p>

<p>
如果你不能在非阻塞模式下运行 fd（例如你不应该使用 Xlib 连接），那么你必须单独重新测试一个文件描述符是否真的准备好了已知的良好接口，如作为 poll（幸运的是，在 Xlib 的情况下，它已经单独执行此操作，因此使用它非常安全）。有些人还使用 SIGALRM 和间隔计时器，只是为了确保你不会无限期地阻止。
</p>

<p>
但实际上，最好使用非阻塞模式。
</p>
</div>


<div id="outline-container-orgc620c60" class="outline-4">
<h4 id="orgc620c60"><span class="section-number-4">13.1.1</span> The special problem of disappearing file descriptors</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
需要告知一些后端（例如 kqueue，epoll，linuxaio）关闭文件描述符（由于明确地调用 close 或任何其他方式，例如 dup2）。原因是注册了感兴趣的某些文件描述符，但是当它消失时，操作系统将默默地放弃。如果使用 libev 注册了具有相同编号的另一个文件描述符，则没有有效的方法可以看出这实际上是一个不同的文件描述符。
</p>

<p>
为了避免必须明确告诉 libev 这样的情况，libev 遵循以下策略：每次调用 ev_io_set 时，libev 都会认为这可能是一个新的文件描述符，否则假定文件描述符保持不变。这意味着即使文件描述符编号本身没有改变，您也必须在更改描述符时调用 ev_io_set（或 ev_io_init）。
</p>

<p>
无论如何，这就是人们通常会这样做的方式，重要的一点是 libev 应用程序不应该围绕 libev 进行优化，而应该对 libev 进行优化。
</p>
</div>
</div>

<div id="outline-container-org1d5d060" class="outline-4">
<h4 id="org1d5d060"><span class="section-number-4">13.1.2</span> The special problem of dup'ed file descriptors</h4>
<div class="outline-text-4" id="text-13-1-2">
<p>
某些后端（例如 epoll）不能为文件描述符注册事件，而只能注册基础文件描述的事件。这意味着当你有 dup（）产生的文件描述符或更奇怪的时，并为它们注册事件时，只有一个文件描述符可能实际上接收事件。
</p>

<p>
除了不为潜在的 dup（）产生的文件描述符注册事件，或者使用 EVBACKEND_SELECT 或 EVBACKEND_POLL 之外，没有可能的解决方法。
</p>
</div>
</div>

<div id="outline-container-org6bae8a7" class="outline-4">
<h4 id="org6bae8a7"><span class="section-number-4">13.1.3</span> The special problem of files</h4>
<div class="outline-text-4" id="text-13-1-3">
<p>
许多人尝试在表示文件的文件描述符上使用 select（或 libev），并期望当程序不阻塞磁盘访问时（这可能需要很长时间）才能使其准备就绪。
</p>

<p>
但是，这不能以“预期”的方式工作- 一旦内核知道是否存在以及存在多少数据，就会通知准备就绪，而在打开文件的情况下，情况总是如此，所以你总是得到一个即时通知准备就绪，您的读取（或可能写入）仍将阻止磁盘 I / O.
</p>

<p>
查看它的另一种方法是，在套接字，管道，字符设备等的情况下，有另一方（发送方）自己提供数据，但在文件的情况下，没有这样的事情：磁盘不会自己发送数据，只是因为它不知道你想要读什么- 你首先要请求一些数据。
</p>

<p>
由于高级通知机制通常不支持文件，因此即使您不应该使用文件，libev 也会尝试模拟文件的 POSIX 行为。这样做的原因是方便：有时你想看 STDIN 或 STDOUT，它通常是一个 tty，通常是一个管道，但有时也有文件或特殊设备（例如，Linux 上的 epoll 与/ dev / random 一起使用但不能用/ dev / urandom），即使文件可能更适合使用异步 I / O 而不是非阻塞 I / O，但它仍然有用，当它“正常工作”而不是冻结时。
</p>

<p>
因此，当你知道它时，避免使用指向文件的文件描述符（例如使用 libeio），但在方便的时候使用它们，例如：对于 STDIN / STDOUT，或者很少从文件而不是从套接字读取，并且想要重用
</p>
</div>
</div>

<div id="outline-container-orge0bf48d" class="outline-4">
<h4 id="orge0bf48d"><span class="section-number-4">13.1.4</span> The special problem of fork</h4>
<div class="outline-text-4" id="text-13-1-4">
<p>
一些后端（epoll，kqueue，linuxaio，iouring）根本不支持 fork（）或表现出无用的行为。 Libev 完全支持 fork，但如果你想继续在子进程身上使用它，需要在子进程身上告诉它。
</p>

<p>
要在子进程中支持 fork，必须在子进程中调用 ev_loop_fork（），启用 EVFLAG_FORKCHECK，或使用 EVBACKEND_SELECT 或 EVBACKEND_POL
</p>
</div>
</div>

<div id="outline-container-orga2f677a" class="outline-4">
<h4 id="orga2f677a"><span class="section-number-4">13.1.5</span> The special problem of SIGPIPE</h4>
<div class="outline-text-4" id="text-13-1-5">
<p>
虽然不是特别针对 libev，但很容易忘记 SIGPIPE：当写入另一端关闭的管道时，程序会被发送一个 SIGPIPE，默认情况下会中止你的程序。对于大多数程序来说，这是明智的行为，对于守护进程来说，这通常是不可取的。
</p>

<p>
因此，当您遇到虚假的，无法解释的守护进程退出时，请确保忽略 SIGPIPE（并且可能确保将守护进程的退出状态记录在某处，因为这会给您一个很大的线索）。
</p>
</div>
</div>

<div id="outline-container-org981ad8b" class="outline-4">
<h4 id="org981ad8b"><span class="section-number-4">13.1.6</span> The special problem of accept()ing when you can't</h4>
<div class="outline-text-4" id="text-13-1-6">
<p>
POSIX accept 函数的许多实现（例如，在 2004 之后的 Linux 中找到）具有在所有错误情况下不从挂起队列中删除连接的特殊行为。
</p>

<p>
例如，较大的服务器通常用完文件描述符（由于资源限制），导致 accept 由于 ENFILE 失败，但不拒绝连接，导致再次下一次迭代的 libev 信号准备就绪（连接仍然存在），以及通常导致程序以 100％的 CPU 使用率循环。
</p>

<p>
不幸的是，造成这个问题的一组错误在操作系统之间有所不同，应用程序通常很少能够解决这种情况，并且没有已知的线程安全方法来删除连接以应对过载（对我而言）。
</p>

<p>
处理这种情况最简单的方法之一就是忽略它 - 当程序遇到重载时，它会循环直到情况结束。虽然这是一种忙碌等待的形式，但没有操作系统提供基于事件的方式来处理这种情况，因此它是最好的方法。
</p>

<p>
处理这种情况的一种更好的方法是记录除 EAGAIN 和 EWOULDBLOCK 之外的任何错误，确保不要使用这些消息充斥日志，并像往常一样继续，这至少让用户知道可能出错的地方（“提高 ulimit ！“）。对于额外的点，可以在监听 fd“停留一段时间”停止 ev_io 观察者，这会降低 CPU 使用率。
</p>

<p>
如果您的程序是单线程的，那么您还可以为过载情况保留一个虚拟文件描述符（例如，通过打开/ dev / null），当您遇到 ENFILE 或 EMFILE 时，关闭它，运行 accept，关闭该 fd，以及创建一个新的虚拟 fd。在典型的过载情况下，这将优雅地拒绝客户。
</p>

<p>
处理它的最后一种方法是简单地记录错误并退出，就像通常使用 malloc 失败一样，但这会导致容易发生 DoS 攻击。 观察者特定功能
</p>
</div>
</div>
