content/c/3rd-libs/libev-manual.org
*** Watcher-Specific Functions
    + ev_io_init (ev_io *, callback, int fd, int events)
    + ev_io_set (ev_io *, int fd, int events)

      Configures an ev_io watcher. The fd is the file descriptor to receive events for and events is either EV_READ, EV_WRITE or EV_READ | EV_WRITE, to express the desire to receive the given events.

    + int fd [read-only]

      The file descriptor being watched.

    + int events [read-only]

      The events being watched.

*** 示例
    示例：当 STDIN_FILENO 变得易读且只能读取一次时，调用 stdin_readable_cb。由于它可能是行缓冲的，因此您可以尝试在回调中读取整行。
    #+BEGIN_SRC c
static void stdin_readable_cb(struct ev_loop *loop, ev_io *w, int revents) {
  ev_io_stop(loop, w);
  ..read from stdin here(or from w->fd) and handle any I / O errors
}

... struct ev_loop *loop = ev_default_init(0);
ev_io stdin_readable;
ev_io_init(&stdin_readable, stdin_readable_cb, STDIN_FILENO, EV_READ);
ev_io_start(loop, &stdin_readable);
ev_run(loop, 0);
    #+END_SRC

** ev_timer - relative and optionally repeating timeouts

** ev_periodic - to cron or not to cron?

** ev_signal - signal me when a signal gets signalled!

** ev_stat - did the file attributes just change?

** ev_idle - when you've got nothing better to do...

** ev_prepare and ev_check - customise your event loop!

** ev_embed - when one backend isn't enough...

** ev_fork - the audacity to resume the event loop after a fork

** ev_cleanup - even the best things end

** ev_async - how to wake up an event loop

   通常，您不能使用来自多个线程或其他异步源（如信号处理程序）的 ev_loop（而不是多个事件循环 - 这些在不同的线程中使用是安全的）。

   但是，有时您需要唤醒一个您无法控制的事件循环，例如因为它属于另一个线程。这就是 ev_async 观察者所做的事情：只要 ev_async 观察者处于活动状态，您就可以通过调用 ev_async_send 来发信号，这是线程和信号安全的。

   该功能与 ev_signal 观察者非常相似，因为信号本质上也是异步的，并且信号也将被压缩（即，回调调用的数量可能小于 ev_async_send 调用的数量）。实际上，您可以使用信号观察器作为一种“全局异步监视器”，通过在未使用的信号上使用观察器，并使用 ev_feed_signal 从另一个线程发信号通知该观察者，即使不知道哪个循环拥有该信号。

*** Queueing
    ev_async 不支持以任何方式排队数据。原因是作者不知道一个简单的多写单读的队列的算法，算法在所有情况下都有效，并且不需要精心设计以支持像 pthreads 或不可移植的内存访问语义。

    这意味着如果要对数据进行排队，则必须提供自己的队列。但至少我可以告诉你如何在你的队列中实现锁定：


**** queueing from a signal handler context
     要实现无锁排队，您只需添加到信号处理程序中的队列，但是您将阻止观察者回调中的信号处理程序。这是一个为一些虚构的 SIGUSR1 处理程序执行此操作的示例：
     #+BEGIN_SRC c
static ev_async mysig;

static void sigusr1_handler(void) {
  sometype data;

  // no locking etc.
  queue_put(data);
  ev_async_send(EV_DEFAULT_ & mysig);
}

static void mysig_cb(EV_P_ ev_async *w, int revents) {
  sometype data;
  sigset_t block, prev;

  sigemptyset(&block);
  sigaddset(&block, SIGUSR1);
  sigprocmask(SIG_BLOCK, &block, &prev);

  while (queue_get(&data)) process(data);

     if (sigismember (&prev, SIGUSR1)
       sigprocmask (SIG_UNBLOCK, &block, 0);
}
     #+END_SRC
     注意：理论上 pthreads 要求你在使用线程时使用 pthread_setmask 而不是 sigprocmask，但 libev 也不会这样做......）。

**** queueing from a thread context
     线程的策略是不同的，因为您不能（轻松地）阻止线程，但您可以轻松地抢占它们，因此要安全地排队，您需要使用传统的互斥锁，例如在此 pthread 示例中：
     #+BEGIN_SRC c
static ev_async mysig;
static pthread_mutex_t mymutex = PTHREAD_MUTEX_INITIALIZER;

static void otherthread(void) {
  // only need to lock the actual queueing operation
  pthread_mutex_lock(&mymutex);
  queue_put(data);
  pthread_mutex_unlock(&mymutex);

  ev_async_send(EV_DEFAULT_ & mysig);
}

static void mysig_cb(EV_P_ ev_async *w, int revents) {
  pthread_mutex_lock(&mymutex);

  while (queue_get(&data)) process(data);

  pthread_mutex_unlock(&mymutex);
}
     #+END_SRC

*** Watcher-Specific Functions and Data Members
    + ev_async_init (ev_async *, callback)
    + ev_async_send (loop, ev_async *)
    + bool = ev_async_pending (ev_async *)

* 通用或有用的模型

* 模拟 libevent

* C++ 支持

* 其他语言绑定

* 宏魔法

* 嵌套

* 与其他程序、库或者环境交互

* 可移植性注意事项

* 算法复杂度

* 从 LIBEV 3.X 到 4.X 的移植

* 词汇表

* 作者
  作者 Marc Lehmann <libev@schmorp.de>，由 Mikael Magnusson 和 Emanuele Giaquinta 反复修正，以及许多其他人的小修正。
