c/3rd-libs/libev-manual.html

<div id="outline-container-orgea4dfd4" class="outline-4">
<h4 id="orgea4dfd4"><span class="section-number-4">13.1.7</span> Watcher-Specific Functions</h4>
<div class="outline-text-4" id="text-13-1-7">
<ul class="org-ul">
<li>ev_io_init (ev_io *, callback, int fd, int events)</li>
<li><p>
ev_io_set (ev_io *, int fd, int events)
</p>

<p>
Configures an ev_io watcher. The fd is the file descriptor to receive events for and events is either EV_READ, EV_WRITE or EV_READ | EV_WRITE, to express the desire to receive the given events.
</p></li>

<li><p>
int fd [read-only]
</p>

<p>
The file descriptor being watched.
</p></li>

<li><p>
int events [read-only]
</p>

<p>
The events being watched.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org15223c8" class="outline-4">
<h4 id="org15223c8"><span class="section-number-4">13.1.8</span> 示例</h4>
<div class="outline-text-4" id="text-13-1-8">
<p>
示例：当 STDIN_FILENO 变得易读且只能读取一次时，调用 stdin_readable_cb。由于它可能是行缓冲的，因此您可以尝试在回调中读取整行。
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">stdin_readable_cb</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">ev_loop</span> *<span style="color: #ff8700;">loop</span>, <span style="color: #00d7af;">ev_io</span> *<span style="color: #ff8700;">w</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">revents</span>) {
  ev_io_stop(loop, w);
  ..read from stdin here(or <span style="color: #00d7af;">from</span> <span style="color: #ff8700;">w</span>-&gt;fd) and handle <span style="color: #00d7af;">any</span> <span style="color: #ff8700;">I</span> / O errors
}

... <span style="color: #a1db00;">struct</span> ev_loop *loop = ev_default_init(0);
<span style="color: #00d7af;">ev_io</span> <span style="color: #ff8700;">stdin_readable</span>;
ev_io_init(&amp;stdin_readable, stdin_readable_cb, STDIN_FILENO, EV_READ);
<span style="color: #ffd700;">ev_io_start</span>(loop, &amp;stdin_readable);
<span style="color: #ffd700;">ev_run</span>(loop, 0);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2c6c73f" class="outline-3">
<h3 id="org2c6c73f"><span class="section-number-3">13.2</span> ev_timer - relative and optionally repeating timeouts</h3>
</div>

<div id="outline-container-org9917a5a" class="outline-3">
<h3 id="org9917a5a"><span class="section-number-3">13.3</span> ev_periodic - to cron or not to cron?</h3>
</div>

<div id="outline-container-org3eec9ea" class="outline-3">
<h3 id="org3eec9ea"><span class="section-number-3">13.4</span> ev_signal - signal me when a signal gets signalled!</h3>
</div>

<div id="outline-container-orgc46608f" class="outline-3">
<h3 id="orgc46608f"><span class="section-number-3">13.5</span> ev_stat - did the file attributes just change?</h3>
</div>

<div id="outline-container-orge4ab9fa" class="outline-3">
<h3 id="orge4ab9fa"><span class="section-number-3">13.6</span> ev_idle - when you've got nothing better to do&#x2026;</h3>
</div>

<div id="outline-container-orgbe8386e" class="outline-3">
<h3 id="orgbe8386e"><span class="section-number-3">13.7</span> ev_prepare and ev_check - customise your event loop!</h3>
</div>

<div id="outline-container-org0a15941" class="outline-3">
<h3 id="org0a15941"><span class="section-number-3">13.8</span> ev_embed - when one backend isn't enough&#x2026;</h3>
</div>

<div id="outline-container-org6ec0565" class="outline-3">
<h3 id="org6ec0565"><span class="section-number-3">13.9</span> ev_fork - the audacity to resume the event loop after a fork</h3>
</div>

<div id="outline-container-orgb3add93" class="outline-3">
<h3 id="orgb3add93"><span class="section-number-3">13.10</span> ev_cleanup - even the best things end</h3>
</div>

<div id="outline-container-org1b01117" class="outline-3">
<h3 id="org1b01117"><span class="section-number-3">13.11</span> ev_async - how to wake up an event loop</h3>
<div class="outline-text-3" id="text-13-11">
<p>
通常，您不能使用来自多个线程或其他异步源（如信号处理程序）的 ev_loop（而不是多个事件循环 - 这些在不同的线程中使用是安全的）。
</p>

<p>
但是，有时您需要唤醒一个您无法控制的事件循环，例如因为它属于另一个线程。这就是 ev_async 观察者所做的事情：只要 ev_async 观察者处于活动状态，您就可以通过调用 ev_async_send 来发信号，这是线程和信号安全的。
</p>

<p>
该功能与 ev_signal 观察者非常相似，因为信号本质上也是异步的，并且信号也将被压缩（即，回调调用的数量可能小于 ev_async_send 调用的数量）。实际上，您可以使用信号观察器作为一种“全局异步监视器”，通过在未使用的信号上使用观察器，并使用 ev_feed_signal 从另一个线程发信号通知该观察者，即使不知道哪个循环拥有该信号。
</p>
</div>

<div id="outline-container-org3f3dea8" class="outline-4">
<h4 id="org3f3dea8"><span class="section-number-4">13.11.1</span> Queueing</h4>
<div class="outline-text-4" id="text-13-11-1">
<p>
ev_async 不支持以任何方式排队数据。原因是作者不知道一个简单的多写单读的队列的算法，算法在所有情况下都有效，并且不需要精心设计以支持像 pthreads 或不可移植的内存访问语义。
</p>

<p>
这意味着如果要对数据进行排队，则必须提供自己的队列。但至少我可以告诉你如何在你的队列中实现锁定：
</p>
</div>


<div id="outline-container-org37c1b9e" class="outline-5">
<h5 id="org37c1b9e"><span class="section-number-5">13.11.1.1</span> queueing from a signal handler context</h5>
<div class="outline-text-5" id="text-13-11-1-1">
<p>
要实现无锁排队，您只需添加到信号处理程序中的队列，但是您将阻止观察者回调中的信号处理程序。这是一个为一些虚构的 SIGUSR1 处理程序执行此操作的示例：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a1db00;">static</span> <span style="color: #00d7af;">ev_async</span> <span style="color: #ff8700;">mysig</span>;

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">sigusr1_handler</span>(<span style="color: #00d7af;">void</span>) {
  <span style="color: #00d7af;">sometype</span> <span style="color: #ff8700;">data</span>;

  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">no locking etc.</span>
  queue_put(data);
  ev_async_send(EV_DEFAULT_ &amp; mysig);
}

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">mysig_cb</span>(EV_P_ <span style="color: #00d7af;">ev_async</span> *<span style="color: #ff8700;">w</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">revents</span>) {
  <span style="color: #00d7af;">sometype</span> <span style="color: #ff8700;">data</span>;
  <span style="color: #00d7af;">sigset_t</span> <span style="color: #ff8700;">block</span>, <span style="color: #ff8700;">prev</span>;

  sigemptyset(&amp;block);
  sigaddset(&amp;block, SIGUSR1);
  sigprocmask(SIG_BLOCK, &amp;block, &amp;prev);

  <span style="color: #a1db00;">while</span> (queue_get(&amp;data)) process(data);

     <span style="color: #a1db00;">if</span> (sigismember (&amp;prev, SIGUSR1)
       sigprocmask (SIG_UNBLOCK, &amp;block, 0);
}
</pre>
</div>
<p>
注意：理论上 pthreads 要求你在使用线程时使用 pthread_setmask 而不是 sigprocmask，但 libev 也不会这样做&#x2026;&#x2026;）。
</p>
</div>
</div>

<div id="outline-container-org341bdb4" class="outline-5">
<h5 id="org341bdb4"><span class="section-number-5">13.11.1.2</span> queueing from a thread context</h5>
<div class="outline-text-5" id="text-13-11-1-2">
<p>
线程的策略是不同的，因为您不能（轻松地）阻止线程，但您可以轻松地抢占它们，因此要安全地排队，您需要使用传统的互斥锁，例如在此 pthread 示例中：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a1db00;">static</span> <span style="color: #00d7af;">ev_async</span> <span style="color: #ff8700;">mysig</span>;
<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">pthread_mutex_t</span> <span style="color: #ff8700;">mymutex</span> = PTHREAD_MUTEX_INITIALIZER;

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">otherthread</span>(<span style="color: #00d7af;">void</span>) {
  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">only need to lock the actual queueing operation</span>
  pthread_mutex_lock(&amp;mymutex);
  queue_put(data);
  pthread_mutex_unlock(&amp;mymutex);

  ev_async_send(EV_DEFAULT_ &amp; mysig);
}

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">mysig_cb</span>(EV_P_ <span style="color: #00d7af;">ev_async</span> *<span style="color: #ff8700;">w</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">revents</span>) {
  pthread_mutex_lock(&amp;mymutex);

  <span style="color: #a1db00;">while</span> (queue_get(&amp;data)) process(data);

  pthread_mutex_unlock(&amp;mymutex);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7e28929" class="outline-4">
<h4 id="org7e28929"><span class="section-number-4">13.11.2</span> Watcher-Specific Functions and Data Members</h4>
<div class="outline-text-4" id="text-13-11-2">
<ul class="org-ul">
<li>ev_async_init (ev_async *, callback)</li>
<li>ev_async_send (loop, ev_async *)</li>
<li>bool = ev_async_pending (ev_async *)</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org5fd911c" class="outline-2">
<h2 id="org5fd911c"><span class="section-number-2">14</span> 通用或有用的模型</h2>
</div>

<div id="outline-container-org147b8e3" class="outline-2">
<h2 id="org147b8e3"><span class="section-number-2">15</span> 模拟 libevent</h2>
</div>

<div id="outline-container-orga0e392e" class="outline-2">
<h2 id="orga0e392e"><span class="section-number-2">16</span> C++ 支持</h2>
</div>

<div id="outline-container-orgd7b8c3f" class="outline-2">
<h2 id="orgd7b8c3f"><span class="section-number-2">17</span> 其他语言绑定</h2>
</div>

<div id="outline-container-orga65ec71" class="outline-2">
<h2 id="orga65ec71"><span class="section-number-2">18</span> 宏魔法</h2>
</div>

<div id="outline-container-org11f67d2" class="outline-2">
<h2 id="org11f67d2"><span class="section-number-2">19</span> 嵌套</h2>
</div>

<div id="outline-container-org89ec2ec" class="outline-2">
<h2 id="org89ec2ec"><span class="section-number-2">20</span> 与其他程序、库或者环境交互</h2>
</div>

<div id="outline-container-org09a9d7b" class="outline-2">
<h2 id="org09a9d7b"><span class="section-number-2">21</span> 可移植性注意事项</h2>
</div>

<div id="outline-container-org714b3c0" class="outline-2">
<h2 id="org714b3c0"><span class="section-number-2">22</span> 算法复杂度</h2>
</div>

<div id="outline-container-orgd728d53" class="outline-2">
<h2 id="orgd728d53"><span class="section-number-2">23</span> 从 LIBEV 3.X 到 4.X 的移植</h2>
</div>

<div id="outline-container-orgc7dc7b1" class="outline-2">
<h2 id="orgc7dc7b1"><span class="section-number-2">24</span> 词汇表</h2>
</div>

<div id="outline-container-org97ba8c9" class="outline-2">
<h2 id="org97ba8c9"><span class="section-number-2">25</span> 作者</h2>
<div class="outline-text-2" id="text-25">
<p>
作者 Marc Lehmann &lt;libev@schmorp.de&gt;，由 Mikael Magnusson 和 Emanuele Giaquinta 反复修正，以及许多其他人的小修正。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-06 五 17:42</p>
<p class="validation"></p>
</div>
</body>
</html>
